RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dtsrc_reg.h
/**
  ******************************************************************************
  * @file    dtsrc_reg.h
  * @version V1.0
  * @date    2021-09-10
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DTSRC_REG_H__
#define __DTSRC_REG_H__

#include "bl808.h"

/* 0x0 : config */
#define DTSRC_CONFIG_OFFSET             (0x0)
#define DTSRC_CR_ENABLE                 DTSRC_CR_ENABLE
#define DTSRC_CR_ENABLE_POS             (0U)
#define DTSRC_CR_ENABLE_LEN             (1U)
#define DTSRC_CR_ENABLE_MSK             (((1U << DTSRC_CR_ENABLE_LEN) - 1) << DTSRC_CR_ENABLE_POS)
#define DTSRC_CR_ENABLE_UMSK            (~(((1U << DTSRC_CR_ENABLE_LEN) - 1) << DTSRC_CR_ENABLE_POS))
#define DTSRC_CR_AXI_EN                 DTSRC_CR_AXI_EN
#define DTSRC_CR_AXI_EN_POS             (1U)
#define DTSRC_CR_AXI_EN_LEN             (1U)
#define DTSRC_CR_AXI_EN_MSK             (((1U << DTSRC_CR_AXI_EN_LEN) - 1) << DTSRC_CR_AXI_EN_POS)
#define DTSRC_CR_AXI_EN_UMSK            (~(((1U << DTSRC_CR_AXI_EN_LEN) - 1) << DTSRC_CR_AXI_EN_POS))
#define DTSRC_CR_MODE_CEA_861           DTSRC_CR_MODE_CEA_861
#define DTSRC_CR_MODE_CEA_861_POS       (2U)
#define DTSRC_CR_MODE_CEA_861_LEN       (1U)
#define DTSRC_CR_MODE_CEA_861_MSK       (((1U << DTSRC_CR_MODE_CEA_861_LEN) - 1) << DTSRC_CR_MODE_CEA_861_POS)
#define DTSRC_CR_MODE_CEA_861_UMSK      (~(((1U << DTSRC_CR_MODE_CEA_861_LEN) - 1) << DTSRC_CR_MODE_CEA_861_POS))
#define DTSRC_CR_SNSR_EN                DTSRC_CR_SNSR_EN
#define DTSRC_CR_SNSR_EN_POS            (3U)
#define DTSRC_CR_SNSR_EN_LEN            (1U)
#define DTSRC_CR_SNSR_EN_MSK            (((1U << DTSRC_CR_SNSR_EN_LEN) - 1) << DTSRC_CR_SNSR_EN_POS)
#define DTSRC_CR_SNSR_EN_UMSK           (~(((1U << DTSRC_CR_SNSR_EN_LEN) - 1) << DTSRC_CR_SNSR_EN_POS))
#define DTSRC_CR_SNSR_HSYNC_INV         DTSRC_CR_SNSR_HSYNC_INV
#define DTSRC_CR_SNSR_HSYNC_INV_POS     (4U)
#define DTSRC_CR_SNSR_HSYNC_INV_LEN     (1U)
#define DTSRC_CR_SNSR_HSYNC_INV_MSK     (((1U << DTSRC_CR_SNSR_HSYNC_INV_LEN) - 1) << DTSRC_CR_SNSR_HSYNC_INV_POS)
#define DTSRC_CR_SNSR_HSYNC_INV_UMSK    (~(((1U << DTSRC_CR_SNSR_HSYNC_INV_LEN) - 1) << DTSRC_CR_SNSR_HSYNC_INV_POS))
#define DTSRC_CR_SNSR_VSYNC_INV         DTSRC_CR_SNSR_VSYNC_INV
#define DTSRC_CR_SNSR_VSYNC_INV_POS     (5U)
#define DTSRC_CR_SNSR_VSYNC_INV_LEN     (1U)
#define DTSRC_CR_SNSR_VSYNC_INV_MSK     (((1U << DTSRC_CR_SNSR_VSYNC_INV_LEN) - 1) << DTSRC_CR_SNSR_VSYNC_INV_POS)
#define DTSRC_CR_SNSR_VSYNC_INV_UMSK    (~(((1U << DTSRC_CR_SNSR_VSYNC_INV_LEN) - 1) << DTSRC_CR_SNSR_VSYNC_INV_POS))
#define DTSRC_CR_AXI_SWAP_MODE          DTSRC_CR_AXI_SWAP_MODE
#define DTSRC_CR_AXI_SWAP_MODE_POS      (7U)
#define DTSRC_CR_AXI_SWAP_MODE_LEN      (1U)
#define DTSRC_CR_AXI_SWAP_MODE_MSK      (((1U << DTSRC_CR_AXI_SWAP_MODE_LEN) - 1) << DTSRC_CR_AXI_SWAP_MODE_POS)
#define DTSRC_CR_AXI_SWAP_MODE_UMSK     (~(((1U << DTSRC_CR_AXI_SWAP_MODE_LEN) - 1) << DTSRC_CR_AXI_SWAP_MODE_POS))
#define DTSRC_CR_AXI_SWAP_IDX_SEL       DTSRC_CR_AXI_SWAP_IDX_SEL
#define DTSRC_CR_AXI_SWAP_IDX_SEL_POS   (8U)
#define DTSRC_CR_AXI_SWAP_IDX_SEL_LEN   (4U)
#define DTSRC_CR_AXI_SWAP_IDX_SEL_MSK   (((1U << DTSRC_CR_AXI_SWAP_IDX_SEL_LEN) - 1) << DTSRC_CR_AXI_SWAP_IDX_SEL_POS)
#define DTSRC_CR_AXI_SWAP_IDX_SEL_UMSK  (~(((1U << DTSRC_CR_AXI_SWAP_IDX_SEL_LEN) - 1) << DTSRC_CR_AXI_SWAP_IDX_SEL_POS))
#define DTSRC_CR_AXI_SWAP_IDX_SWM       DTSRC_CR_AXI_SWAP_IDX_SWM
#define DTSRC_CR_AXI_SWAP_IDX_SWM_POS   (12U)
#define DTSRC_CR_AXI_SWAP_IDX_SWM_LEN   (1U)
#define DTSRC_CR_AXI_SWAP_IDX_SWM_MSK   (((1U << DTSRC_CR_AXI_SWAP_IDX_SWM_LEN) - 1) << DTSRC_CR_AXI_SWAP_IDX_SWM_POS)
#define DTSRC_CR_AXI_SWAP_IDX_SWM_UMSK  (~(((1U << DTSRC_CR_AXI_SWAP_IDX_SWM_LEN) - 1) << DTSRC_CR_AXI_SWAP_IDX_SWM_POS))
#define DTSRC_CR_AXI_SWAP_IDX_SWV       DTSRC_CR_AXI_SWAP_IDX_SWV
#define DTSRC_CR_AXI_SWAP_IDX_SWV_POS   (13U)
#define DTSRC_CR_AXI_SWAP_IDX_SWV_LEN   (1U)
#define DTSRC_CR_AXI_SWAP_IDX_SWV_MSK   (((1U << DTSRC_CR_AXI_SWAP_IDX_SWV_LEN) - 1) << DTSRC_CR_AXI_SWAP_IDX_SWV_POS)
#define DTSRC_CR_AXI_SWAP_IDX_SWV_UMSK  (~(((1U << DTSRC_CR_AXI_SWAP_IDX_SWV_LEN) - 1) << DTSRC_CR_AXI_SWAP_IDX_SWV_POS))
#define DTSRC_CR_AXI_DVP_DATA_MODE      DTSRC_CR_AXI_DVP_DATA_MODE
#define DTSRC_CR_AXI_DVP_DATA_MODE_POS  (16U)
#define DTSRC_CR_AXI_DVP_DATA_MODE_LEN  (3U)
#define DTSRC_CR_AXI_DVP_DATA_MODE_MSK  (((1U << DTSRC_CR_AXI_DVP_DATA_MODE_LEN) - 1) << DTSRC_CR_AXI_DVP_DATA_MODE_POS)
#define DTSRC_CR_AXI_DVP_DATA_MODE_UMSK (~(((1U << DTSRC_CR_AXI_DVP_DATA_MODE_LEN) - 1) << DTSRC_CR_AXI_DVP_DATA_MODE_POS))
#define DTSRC_CR_AXI_B0_SEL             DTSRC_CR_AXI_B0_SEL
#define DTSRC_CR_AXI_B0_SEL_POS         (20U)
#define DTSRC_CR_AXI_B0_SEL_LEN         (2U)
#define DTSRC_CR_AXI_B0_SEL_MSK         (((1U << DTSRC_CR_AXI_B0_SEL_LEN) - 1) << DTSRC_CR_AXI_B0_SEL_POS)
#define DTSRC_CR_AXI_B0_SEL_UMSK        (~(((1U << DTSRC_CR_AXI_B0_SEL_LEN) - 1) << DTSRC_CR_AXI_B0_SEL_POS))
#define DTSRC_CR_AXI_B1_SEL             DTSRC_CR_AXI_B1_SEL
#define DTSRC_CR_AXI_B1_SEL_POS         (22U)
#define DTSRC_CR_AXI_B1_SEL_LEN         (2U)
#define DTSRC_CR_AXI_B1_SEL_MSK         (((1U << DTSRC_CR_AXI_B1_SEL_LEN) - 1) << DTSRC_CR_AXI_B1_SEL_POS)
#define DTSRC_CR_AXI_B1_SEL_UMSK        (~(((1U << DTSRC_CR_AXI_B1_SEL_LEN) - 1) << DTSRC_CR_AXI_B1_SEL_POS))
#define DTSRC_CR_AXI_B2_SEL             DTSRC_CR_AXI_B2_SEL
#define DTSRC_CR_AXI_B2_SEL_POS         (24U)
#define DTSRC_CR_AXI_B2_SEL_LEN         (2U)
#define DTSRC_CR_AXI_B2_SEL_MSK         (((1U << DTSRC_CR_AXI_B2_SEL_LEN) - 1) << DTSRC_CR_AXI_B2_SEL_POS)
#define DTSRC_CR_AXI_B2_SEL_UMSK        (~(((1U << DTSRC_CR_AXI_B2_SEL_LEN) - 1) << DTSRC_CR_AXI_B2_SEL_POS))

/* 0x4 : frame_size_h */
#define DTSRC_FRAME_SIZE_H_OFFSET (0x4)
#define DTSRC_CR_TOTAL_H          DTSRC_CR_TOTAL_H
#define DTSRC_CR_TOTAL_H_POS      (0U)
#define DTSRC_CR_TOTAL_H_LEN      (12U)
#define DTSRC_CR_TOTAL_H_MSK      (((1U << DTSRC_CR_TOTAL_H_LEN) - 1) << DTSRC_CR_TOTAL_H_POS)
#define DTSRC_CR_TOTAL_H_UMSK     (~(((1U << DTSRC_CR_TOTAL_H_LEN) - 1) << DTSRC_CR_TOTAL_H_POS))
#define DTSRC_CR_BLANK_H          DTSRC_CR_BLANK_H
#define DTSRC_CR_BLANK_H_POS      (16U)
#define DTSRC_CR_BLANK_H_LEN      (12U)
#define DTSRC_CR_BLANK_H_MSK      (((1U << DTSRC_CR_BLANK_H_LEN) - 1) << DTSRC_CR_BLANK_H_POS)
#define DTSRC_CR_BLANK_H_UMSK     (~(((1U << DTSRC_CR_BLANK_H_LEN) - 1) << DTSRC_CR_BLANK_H_POS))

/* 0x8 : frame_size_v */
#define DTSRC_FRAME_SIZE_V_OFFSET (0x8)
#define DTSRC_CR_TOTAL_V          DTSRC_CR_TOTAL_V
#define DTSRC_CR_TOTAL_V_POS      (0U)
#define DTSRC_CR_TOTAL_V_LEN      (12U)
#define DTSRC_CR_TOTAL_V_MSK      (((1U << DTSRC_CR_TOTAL_V_LEN) - 1) << DTSRC_CR_TOTAL_V_POS)
#define DTSRC_CR_TOTAL_V_UMSK     (~(((1U << DTSRC_CR_TOTAL_V_LEN) - 1) << DTSRC_CR_TOTAL_V_POS))
#define DTSRC_CR_BLANK_V          DTSRC_CR_BLANK_V
#define DTSRC_CR_BLANK_V_POS      (16U)
#define DTSRC_CR_BLANK_V_LEN      (12U)
#define DTSRC_CR_BLANK_V_MSK      (((1U << DTSRC_CR_BLANK_V_LEN) - 1) << DTSRC_CR_BLANK_V_POS)
#define DTSRC_CR_BLANK_V_UMSK     (~(((1U << DTSRC_CR_BLANK_V_LEN) - 1) << DTSRC_CR_BLANK_V_POS))

