RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dtsrc_reg.h
/* 0xC : frame_size_cea_861 */
#define DTSRC_FRAME_SIZE_CEA_861_OFFSET (0xC)
#define DTSRC_CR_H_DURATION             DTSRC_CR_H_DURATION
#define DTSRC_CR_H_DURATION_POS         (0U)
#define DTSRC_CR_H_DURATION_LEN         (8U)
#define DTSRC_CR_H_DURATION_MSK         (((1U << DTSRC_CR_H_DURATION_LEN) - 1) << DTSRC_CR_H_DURATION_POS)
#define DTSRC_CR_H_DURATION_UMSK        (~(((1U << DTSRC_CR_H_DURATION_LEN) - 1) << DTSRC_CR_H_DURATION_POS))
#define DTSRC_CR_H_PLACEMENT            DTSRC_CR_H_PLACEMENT
#define DTSRC_CR_H_PLACEMENT_POS        (8U)
#define DTSRC_CR_H_PLACEMENT_LEN        (8U)
#define DTSRC_CR_H_PLACEMENT_MSK        (((1U << DTSRC_CR_H_PLACEMENT_LEN) - 1) << DTSRC_CR_H_PLACEMENT_POS)
#define DTSRC_CR_H_PLACEMENT_UMSK       (~(((1U << DTSRC_CR_H_PLACEMENT_LEN) - 1) << DTSRC_CR_H_PLACEMENT_POS))
#define DTSRC_CR_V_DURATION             DTSRC_CR_V_DURATION
#define DTSRC_CR_V_DURATION_POS         (16U)
#define DTSRC_CR_V_DURATION_LEN         (8U)
#define DTSRC_CR_V_DURATION_MSK         (((1U << DTSRC_CR_V_DURATION_LEN) - 1) << DTSRC_CR_V_DURATION_POS)
#define DTSRC_CR_V_DURATION_UMSK        (~(((1U << DTSRC_CR_V_DURATION_LEN) - 1) << DTSRC_CR_V_DURATION_POS))
#define DTSRC_CR_V_PLACEMENT            DTSRC_CR_V_PLACEMENT
#define DTSRC_CR_V_PLACEMENT_POS        (24U)
#define DTSRC_CR_V_PLACEMENT_LEN        (8U)
#define DTSRC_CR_V_PLACEMENT_MSK        (((1U << DTSRC_CR_V_PLACEMENT_LEN) - 1) << DTSRC_CR_V_PLACEMENT_POS)
#define DTSRC_CR_V_PLACEMENT_UMSK       (~(((1U << DTSRC_CR_V_PLACEMENT_LEN) - 1) << DTSRC_CR_V_PLACEMENT_POS))

/* 0x10 : pix_data_range */
#define DTSRC_PIX_DATA_RANGE_OFFSET (0x10)
#define DTSRC_CR_DATA_MIN           DTSRC_CR_DATA_MIN
#define DTSRC_CR_DATA_MIN_POS       (0U)
#define DTSRC_CR_DATA_MIN_LEN       (16U)
#define DTSRC_CR_DATA_MIN_MSK       (((1U << DTSRC_CR_DATA_MIN_LEN) - 1) << DTSRC_CR_DATA_MIN_POS)
#define DTSRC_CR_DATA_MIN_UMSK      (~(((1U << DTSRC_CR_DATA_MIN_LEN) - 1) << DTSRC_CR_DATA_MIN_POS))
#define DTSRC_CR_DATA_MAX           DTSRC_CR_DATA_MAX
#define DTSRC_CR_DATA_MAX_POS       (16U)
#define DTSRC_CR_DATA_MAX_LEN       (16U)
#define DTSRC_CR_DATA_MAX_MSK       (((1U << DTSRC_CR_DATA_MAX_LEN) - 1) << DTSRC_CR_DATA_MAX_POS)
#define DTSRC_CR_DATA_MAX_UMSK      (~(((1U << DTSRC_CR_DATA_MAX_LEN) - 1) << DTSRC_CR_DATA_MAX_POS))

/* 0x14 : pix_data_step */
#define DTSRC_PIX_DATA_STEP_OFFSET (0x14)
#define DTSRC_CR_DATA_STEP         DTSRC_CR_DATA_STEP
#define DTSRC_CR_DATA_STEP_POS     (0U)
#define DTSRC_CR_DATA_STEP_LEN     (8U)
#define DTSRC_CR_DATA_STEP_MSK     (((1U << DTSRC_CR_DATA_STEP_LEN) - 1) << DTSRC_CR_DATA_STEP_POS)
#define DTSRC_CR_DATA_STEP_UMSK    (~(((1U << DTSRC_CR_DATA_STEP_LEN) - 1) << DTSRC_CR_DATA_STEP_POS))

/* 0x20 : axi2dvp_setting */
#define DTSRC_AXI2DVP_SETTING_OFFSET    (0x20)
#define DTSRC_CR_AXI_XLEN               DTSRC_CR_AXI_XLEN
#define DTSRC_CR_AXI_XLEN_POS           (0U)
#define DTSRC_CR_AXI_XLEN_LEN           (3U)
#define DTSRC_CR_AXI_XLEN_MSK           (((1U << DTSRC_CR_AXI_XLEN_LEN) - 1) << DTSRC_CR_AXI_XLEN_POS)
#define DTSRC_CR_AXI_XLEN_UMSK          (~(((1U << DTSRC_CR_AXI_XLEN_LEN) - 1) << DTSRC_CR_AXI_XLEN_POS))
#define DTSRC_CR_AXI_DRAIN_ERR_CLR      DTSRC_CR_AXI_DRAIN_ERR_CLR
#define DTSRC_CR_AXI_DRAIN_ERR_CLR_POS  (4U)
#define DTSRC_CR_AXI_DRAIN_ERR_CLR_LEN  (1U)
#define DTSRC_CR_AXI_DRAIN_ERR_CLR_MSK  (((1U << DTSRC_CR_AXI_DRAIN_ERR_CLR_LEN) - 1) << DTSRC_CR_AXI_DRAIN_ERR_CLR_POS)
#define DTSRC_CR_AXI_DRAIN_ERR_CLR_UMSK (~(((1U << DTSRC_CR_AXI_DRAIN_ERR_CLR_LEN) - 1) << DTSRC_CR_AXI_DRAIN_ERR_CLR_POS))
#define DTSRC_CR_AXI_420_MODE           DTSRC_CR_AXI_420_MODE
#define DTSRC_CR_AXI_420_MODE_POS       (8U)
#define DTSRC_CR_AXI_420_MODE_LEN       (1U)
#define DTSRC_CR_AXI_420_MODE_MSK       (((1U << DTSRC_CR_AXI_420_MODE_LEN) - 1) << DTSRC_CR_AXI_420_MODE_POS)
#define DTSRC_CR_AXI_420_MODE_UMSK      (~(((1U << DTSRC_CR_AXI_420_MODE_LEN) - 1) << DTSRC_CR_AXI_420_MODE_POS))
#define DTSRC_CR_AXI_420_UD_SEL         DTSRC_CR_AXI_420_UD_SEL
#define DTSRC_CR_AXI_420_UD_SEL_POS     (9U)
#define DTSRC_CR_AXI_420_UD_SEL_LEN     (1U)
#define DTSRC_CR_AXI_420_UD_SEL_MSK     (((1U << DTSRC_CR_AXI_420_UD_SEL_LEN) - 1) << DTSRC_CR_AXI_420_UD_SEL_POS)
#define DTSRC_CR_AXI_420_UD_SEL_UMSK    (~(((1U << DTSRC_CR_AXI_420_UD_SEL_LEN) - 1) << DTSRC_CR_AXI_420_UD_SEL_POS))
#define DTSRC_CR_QOS_SW_MODE            DTSRC_CR_QOS_SW_MODE
#define DTSRC_CR_QOS_SW_MODE_POS        (10U)
#define DTSRC_CR_QOS_SW_MODE_LEN        (1U)
#define DTSRC_CR_QOS_SW_MODE_MSK        (((1U << DTSRC_CR_QOS_SW_MODE_LEN) - 1) << DTSRC_CR_QOS_SW_MODE_POS)
#define DTSRC_CR_QOS_SW_MODE_UMSK       (~(((1U << DTSRC_CR_QOS_SW_MODE_LEN) - 1) << DTSRC_CR_QOS_SW_MODE_POS))
#define DTSRC_CR_QOS_SW                 DTSRC_CR_QOS_SW
#define DTSRC_CR_QOS_SW_POS             (11U)
#define DTSRC_CR_QOS_SW_LEN             (1U)
#define DTSRC_CR_QOS_SW_MSK             (((1U << DTSRC_CR_QOS_SW_LEN) - 1) << DTSRC_CR_QOS_SW_POS)
#define DTSRC_CR_QOS_SW_UMSK            (~(((1U << DTSRC_CR_QOS_SW_LEN) - 1) << DTSRC_CR_QOS_SW_POS))

/* 0x24 : axi2dvp_start_addr_by */
#define DTSRC_AXI2DVP_START_ADDR_BY_OFFSET (0x24)
#define DTSRC_CR_AXI_ADDR_START_BY         DTSRC_CR_AXI_ADDR_START_BY
#define DTSRC_CR_AXI_ADDR_START_BY_POS     (0U)
#define DTSRC_CR_AXI_ADDR_START_BY_LEN     (32U)
#define DTSRC_CR_AXI_ADDR_START_BY_MSK     (((1U << DTSRC_CR_AXI_ADDR_START_BY_LEN) - 1) << DTSRC_CR_AXI_ADDR_START_BY_POS)
#define DTSRC_CR_AXI_ADDR_START_BY_UMSK    (~(((1U << DTSRC_CR_AXI_ADDR_START_BY_LEN) - 1) << DTSRC_CR_AXI_ADDR_START_BY_POS))

/* 0x28 : axi2dvp_burst_cnt */
#define DTSRC_AXI2DVP_BURST_CNT_OFFSET (0x28)
#define DTSRC_CR_AXI_FRAME_BC          DTSRC_CR_AXI_FRAME_BC
#define DTSRC_CR_AXI_FRAME_BC_POS      (0U)
#define DTSRC_CR_AXI_FRAME_BC_LEN      (32U)
#define DTSRC_CR_AXI_FRAME_BC_MSK      (((1U << DTSRC_CR_AXI_FRAME_BC_LEN) - 1) << DTSRC_CR_AXI_FRAME_BC_POS)
#define DTSRC_CR_AXI_FRAME_BC_UMSK     (~(((1U << DTSRC_CR_AXI_FRAME_BC_LEN) - 1) << DTSRC_CR_AXI_FRAME_BC_POS))

/* 0x2C : axi2dvp_status */
#define DTSRC_AXI2DVP_STATUS_OFFSET      (0x2C)
#define DTSRC_ST_AXI_FIFO_CNT_BY         DTSRC_ST_AXI_FIFO_CNT_BY
#define DTSRC_ST_AXI_FIFO_CNT_BY_POS     (0U)
#define DTSRC_ST_AXI_FIFO_CNT_BY_LEN     (7U)
#define DTSRC_ST_AXI_FIFO_CNT_BY_MSK     (((1U << DTSRC_ST_AXI_FIFO_CNT_BY_LEN) - 1) << DTSRC_ST_AXI_FIFO_CNT_BY_POS)
#define DTSRC_ST_AXI_FIFO_CNT_BY_UMSK    (~(((1U << DTSRC_ST_AXI_FIFO_CNT_BY_LEN) - 1) << DTSRC_ST_AXI_FIFO_CNT_BY_POS))
#define DTSRC_ST_AXI_DRAIN_ERROR_BY      DTSRC_ST_AXI_DRAIN_ERROR_BY
#define DTSRC_ST_AXI_DRAIN_ERROR_BY_POS  (7U)
#define DTSRC_ST_AXI_DRAIN_ERROR_BY_LEN  (1U)
#define DTSRC_ST_AXI_DRAIN_ERROR_BY_MSK  (((1U << DTSRC_ST_AXI_DRAIN_ERROR_BY_LEN) - 1) << DTSRC_ST_AXI_DRAIN_ERROR_BY_POS)
#define DTSRC_ST_AXI_DRAIN_ERROR_BY_UMSK (~(((1U << DTSRC_ST_AXI_DRAIN_ERROR_BY_LEN) - 1) << DTSRC_ST_AXI_DRAIN_ERROR_BY_POS))
#define DTSRC_ST_AXI_STATE_IDLE_BY       DTSRC_ST_AXI_STATE_IDLE_BY
#define DTSRC_ST_AXI_STATE_IDLE_BY_POS   (8U)
#define DTSRC_ST_AXI_STATE_IDLE_BY_LEN   (1U)
#define DTSRC_ST_AXI_STATE_IDLE_BY_MSK   (((1U << DTSRC_ST_AXI_STATE_IDLE_BY_LEN) - 1) << DTSRC_ST_AXI_STATE_IDLE_BY_POS)
#define DTSRC_ST_AXI_STATE_IDLE_BY_UMSK  (~(((1U << DTSRC_ST_AXI_STATE_IDLE_BY_LEN) - 1) << DTSRC_ST_AXI_STATE_IDLE_BY_POS))
#define DTSRC_ST_AXI_STATE_FUNC_BY       DTSRC_ST_AXI_STATE_FUNC_BY
#define DTSRC_ST_AXI_STATE_FUNC_BY_POS   (9U)
#define DTSRC_ST_AXI_STATE_FUNC_BY_LEN   (1U)
#define DTSRC_ST_AXI_STATE_FUNC_BY_MSK   (((1U << DTSRC_ST_AXI_STATE_FUNC_BY_LEN) - 1) << DTSRC_ST_AXI_STATE_FUNC_BY_POS)
#define DTSRC_ST_AXI_STATE_FUNC_BY_UMSK  (~(((1U << DTSRC_ST_AXI_STATE_FUNC_BY_LEN) - 1) << DTSRC_ST_AXI_STATE_FUNC_BY_POS))
#define DTSRC_ST_AXI_STATE_FLSH_BY       DTSRC_ST_AXI_STATE_FLSH_BY
#define DTSRC_ST_AXI_STATE_FLSH_BY_POS   (10U)
#define DTSRC_ST_AXI_STATE_FLSH_BY_LEN   (1U)
#define DTSRC_ST_AXI_STATE_FLSH_BY_MSK   (((1U << DTSRC_ST_AXI_STATE_FLSH_BY_LEN) - 1) << DTSRC_ST_AXI_STATE_FLSH_BY_POS)
#define DTSRC_ST_AXI_STATE_FLSH_BY_UMSK  (~(((1U << DTSRC_ST_AXI_STATE_FLSH_BY_LEN) - 1) << DTSRC_ST_AXI_STATE_FLSH_BY_POS))
#define DTSRC_ST_AXI_FIFO_CNT_UV         DTSRC_ST_AXI_FIFO_CNT_UV
#define DTSRC_ST_AXI_FIFO_CNT_UV_POS     (16U)
#define DTSRC_ST_AXI_FIFO_CNT_UV_LEN     (7U)
#define DTSRC_ST_AXI_FIFO_CNT_UV_MSK     (((1U << DTSRC_ST_AXI_FIFO_CNT_UV_LEN) - 1) << DTSRC_ST_AXI_FIFO_CNT_UV_POS)
#define DTSRC_ST_AXI_FIFO_CNT_UV_UMSK    (~(((1U << DTSRC_ST_AXI_FIFO_CNT_UV_LEN) - 1) << DTSRC_ST_AXI_FIFO_CNT_UV_POS))
#define DTSRC_ST_AXI_DRAIN_ERROR_UV      DTSRC_ST_AXI_DRAIN_ERROR_UV
#define DTSRC_ST_AXI_DRAIN_ERROR_UV_POS  (23U)
#define DTSRC_ST_AXI_DRAIN_ERROR_UV_LEN  (1U)
#define DTSRC_ST_AXI_DRAIN_ERROR_UV_MSK  (((1U << DTSRC_ST_AXI_DRAIN_ERROR_UV_LEN) - 1) << DTSRC_ST_AXI_DRAIN_ERROR_UV_POS)
#define DTSRC_ST_AXI_DRAIN_ERROR_UV_UMSK (~(((1U << DTSRC_ST_AXI_DRAIN_ERROR_UV_LEN) - 1) << DTSRC_ST_AXI_DRAIN_ERROR_UV_POS))
#define DTSRC_ST_AXI_STATE_IDLE_UV       DTSRC_ST_AXI_STATE_IDLE_UV
#define DTSRC_ST_AXI_STATE_IDLE_UV_POS   (24U)
#define DTSRC_ST_AXI_STATE_IDLE_UV_LEN   (1U)
#define DTSRC_ST_AXI_STATE_IDLE_UV_MSK   (((1U << DTSRC_ST_AXI_STATE_IDLE_UV_LEN) - 1) << DTSRC_ST_AXI_STATE_IDLE_UV_POS)
#define DTSRC_ST_AXI_STATE_IDLE_UV_UMSK  (~(((1U << DTSRC_ST_AXI_STATE_IDLE_UV_LEN) - 1) << DTSRC_ST_AXI_STATE_IDLE_UV_POS))
#define DTSRC_ST_AXI_STATE_FUNC_UV       DTSRC_ST_AXI_STATE_FUNC_UV
#define DTSRC_ST_AXI_STATE_FUNC_UV_POS   (25U)
#define DTSRC_ST_AXI_STATE_FUNC_UV_LEN   (1U)
#define DTSRC_ST_AXI_STATE_FUNC_UV_MSK   (((1U << DTSRC_ST_AXI_STATE_FUNC_UV_LEN) - 1) << DTSRC_ST_AXI_STATE_FUNC_UV_POS)
#define DTSRC_ST_AXI_STATE_FUNC_UV_UMSK  (~(((1U << DTSRC_ST_AXI_STATE_FUNC_UV_LEN) - 1) << DTSRC_ST_AXI_STATE_FUNC_UV_POS))
#define DTSRC_ST_AXI_STATE_FLSH_UV       DTSRC_ST_AXI_STATE_FLSH_UV
#define DTSRC_ST_AXI_STATE_FLSH_UV_POS   (26U)
#define DTSRC_ST_AXI_STATE_FLSH_UV_LEN   (1U)
#define DTSRC_ST_AXI_STATE_FLSH_UV_MSK   (((1U << DTSRC_ST_AXI_STATE_FLSH_UV_LEN) - 1) << DTSRC_ST_AXI_STATE_FLSH_UV_POS)
#define DTSRC_ST_AXI_STATE_FLSH_UV_UMSK  (~(((1U << DTSRC_ST_AXI_STATE_FLSH_UV_LEN) - 1) << DTSRC_ST_AXI_STATE_FLSH_UV_POS))

