RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dtsrc_reg.h
/* 0x30 : axi2dvp_swap_addr_by */
#define DTSRC_AXI2DVP_SWAP_ADDR_BY_OFFSET (0x30)
#define DTSRC_CR_AXI_ADDR_SWAP_BY         DTSRC_CR_AXI_ADDR_SWAP_BY
#define DTSRC_CR_AXI_ADDR_SWAP_BY_POS     (0U)
#define DTSRC_CR_AXI_ADDR_SWAP_BY_LEN     (32U)
#define DTSRC_CR_AXI_ADDR_SWAP_BY_MSK     (((1U << DTSRC_CR_AXI_ADDR_SWAP_BY_LEN) - 1) << DTSRC_CR_AXI_ADDR_SWAP_BY_POS)
#define DTSRC_CR_AXI_ADDR_SWAP_BY_UMSK    (~(((1U << DTSRC_CR_AXI_ADDR_SWAP_BY_LEN) - 1) << DTSRC_CR_AXI_ADDR_SWAP_BY_POS))

/* 0x34 : axi2dvp_prefetch */
#define DTSRC_AXI2DVP_PREFETCH_OFFSET (0x34)
#define DTSRC_CR_PREFETCH_V           DTSRC_CR_PREFETCH_V
#define DTSRC_CR_PREFETCH_V_POS       (0U)
#define DTSRC_CR_PREFETCH_V_LEN       (12U)
#define DTSRC_CR_PREFETCH_V_MSK       (((1U << DTSRC_CR_PREFETCH_V_LEN) - 1) << DTSRC_CR_PREFETCH_V_POS)
#define DTSRC_CR_PREFETCH_V_UMSK      (~(((1U << DTSRC_CR_PREFETCH_V_LEN) - 1) << DTSRC_CR_PREFETCH_V_POS))

/* 0x38 : snsr2dvp_wait_pos */
#define DTSRC_SNSR2DVP_WAIT_POS_OFFSET (0x38)
#define DTSRC_CR_SNSR_FIFO_TH          DTSRC_CR_SNSR_FIFO_TH
#define DTSRC_CR_SNSR_FIFO_TH_POS      (0U)
#define DTSRC_CR_SNSR_FIFO_TH_LEN      (11U)
#define DTSRC_CR_SNSR_FIFO_TH_MSK      (((1U << DTSRC_CR_SNSR_FIFO_TH_LEN) - 1) << DTSRC_CR_SNSR_FIFO_TH_POS)
#define DTSRC_CR_SNSR_FIFO_TH_UMSK     (~(((1U << DTSRC_CR_SNSR_FIFO_TH_LEN) - 1) << DTSRC_CR_SNSR_FIFO_TH_POS))

/* 0x40 : axi2dvp_start_addr_uv */
#define DTSRC_AXI2DVP_START_ADDR_UV_OFFSET (0x40)
#define DTSRC_CR_AXI_ADDR_START_UV         DTSRC_CR_AXI_ADDR_START_UV
#define DTSRC_CR_AXI_ADDR_START_UV_POS     (0U)
#define DTSRC_CR_AXI_ADDR_START_UV_LEN     (32U)
#define DTSRC_CR_AXI_ADDR_START_UV_MSK     (((1U << DTSRC_CR_AXI_ADDR_START_UV_LEN) - 1) << DTSRC_CR_AXI_ADDR_START_UV_POS)
#define DTSRC_CR_AXI_ADDR_START_UV_UMSK    (~(((1U << DTSRC_CR_AXI_ADDR_START_UV_LEN) - 1) << DTSRC_CR_AXI_ADDR_START_UV_POS))

/* 0x44 : axi2dvp_swap_addr_uv */
#define DTSRC_AXI2DVP_SWAP_ADDR_UV_OFFSET (0x44)
#define DTSRC_CR_AXI_ADDR_SWAP_UV         DTSRC_CR_AXI_ADDR_SWAP_UV
#define DTSRC_CR_AXI_ADDR_SWAP_UV_POS     (0U)
#define DTSRC_CR_AXI_ADDR_SWAP_UV_LEN     (32U)
#define DTSRC_CR_AXI_ADDR_SWAP_UV_MSK     (((1U << DTSRC_CR_AXI_ADDR_SWAP_UV_LEN) - 1) << DTSRC_CR_AXI_ADDR_SWAP_UV_POS)
#define DTSRC_CR_AXI_ADDR_SWAP_UV_UMSK    (~(((1U << DTSRC_CR_AXI_ADDR_SWAP_UV_LEN) - 1) << DTSRC_CR_AXI_ADDR_SWAP_UV_POS))

struct dtsrc_reg {
    /* 0x0 : config */
    union {
        struct {
            uint32_t cr_enable            : 1; /* [    0],        r/w,        0x0 */
            uint32_t cr_axi_en            : 1; /* [    1],        r/w,        0x0 */
            uint32_t cr_mode_cea_861      : 1; /* [    2],        r/w,        0x0 */
            uint32_t cr_snsr_en           : 1; /* [    3],        r/w,        0x0 */
            uint32_t cr_snsr_hsync_inv    : 1; /* [    4],        r/w,        0x0 */
            uint32_t cr_snsr_vsync_inv    : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6           : 1; /* [    6],       rsvd,        0x0 */
            uint32_t cr_axi_swap_mode     : 1; /* [    7],        r/w,        0x0 */
            uint32_t cr_axi_swap_idx_sel  : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t cr_axi_swap_idx_swm  : 1; /* [   12],        r/w,        0x0 */
            uint32_t cr_axi_swap_idx_swv  : 1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15       : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t cr_axi_dvp_data_mode : 3; /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19          : 1; /* [   19],       rsvd,        0x0 */
            uint32_t cr_axi_b0_sel        : 2; /* [21:20],        r/w,        0x0 */
            uint32_t cr_axi_b1_sel        : 2; /* [23:22],        r/w,        0x1 */
            uint32_t cr_axi_b2_sel        : 2; /* [25:24],        r/w,        0x2 */
            uint32_t reserved_26_31       : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } config;

    /* 0x4 : frame_size_h */
    union {
        struct {
            uint32_t cr_total_h     : 12; /* [11: 0],        r/w,      0x897 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t cr_blank_h     : 12; /* [27:16],        r/w,      0x117 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_size_h;

    /* 0x8 : frame_size_v */
    union {
        struct {
            uint32_t cr_total_v     : 12; /* [11: 0],        r/w,      0x464 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t cr_blank_v     : 12; /* [27:16],        r/w,       0x2c */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_size_v;

    /* 0xC : frame_size_cea_861 */
    union {
        struct {
            uint32_t cr_h_duration  : 8; /* [ 7: 0],        r/w,       0x83 */
            uint32_t cr_h_placement : 8; /* [15: 8],        r/w,       0x57 */
            uint32_t cr_v_duration  : 8; /* [23:16],        r/w,        0x8 */
            uint32_t cr_v_placement : 8; /* [31:24],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } frame_size_cea_861;

    /* 0x10 : pix_data_range */
    union {
        struct {
            uint32_t cr_data_min : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t cr_data_max : 16; /* [31:16],        r/w,     0xffff */
        } BF;
        uint32_t WORD;
    } pix_data_range;

    /* 0x14 : pix_data_step */
    union {
        struct {
            uint32_t cr_data_step  : 8;  /* [ 7: 0],        r/w,        0x1 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pix_data_step;

    /* 0x18  reserved */
    uint8_t RESERVED0x18[8];

    /* 0x20 : axi2dvp_setting */
    union {
        struct {
            uint32_t cr_axi_xlen          : 3;  /* [ 2: 0],        r/w,        0x3 */
            uint32_t reserved_3           : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t cr_axi_drain_err_clr : 1;  /* [    4],        w1p,        0x0 */
            uint32_t reserved_5_7         : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cr_axi_420_mode      : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_axi_420_ud_sel    : 1;  /* [    9],        r/w,        0x0 */
            uint32_t cr_qos_sw_mode       : 1;  /* [   10],        r/w,        0x0 */
            uint32_t cr_qos_sw            : 1;  /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_31       : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } axi2dvp_setting;

