RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dtsrc_reg.h
    /* 0x24 : axi2dvp_start_addr_by */
    union {
        struct {
            uint32_t cr_axi_addr_start_by : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } axi2dvp_start_addr_by;

    /* 0x28 : axi2dvp_burst_cnt */
    union {
        struct {
            uint32_t cr_axi_frame_bc : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } axi2dvp_burst_cnt;

    /* 0x2C : axi2dvp_status */
    union {
        struct {
            uint32_t st_axi_fifo_cnt_by    : 7; /* [ 6: 0],          r,        0x0 */
            uint32_t st_axi_drain_error_by : 1; /* [    7],          r,        0x0 */
            uint32_t st_axi_state_idle_by  : 1; /* [    8],          r,        0x0 */
            uint32_t st_axi_state_func_by  : 1; /* [    9],          r,        0x0 */
            uint32_t st_axi_state_flsh_by  : 1; /* [   10],          r,        0x0 */
            uint32_t reserved_11_15        : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t st_axi_fifo_cnt_uv    : 7; /* [22:16],          r,        0x0 */
            uint32_t st_axi_drain_error_uv : 1; /* [   23],          r,        0x0 */
            uint32_t st_axi_state_idle_uv  : 1; /* [   24],          r,        0x0 */
            uint32_t st_axi_state_func_uv  : 1; /* [   25],          r,        0x0 */
            uint32_t st_axi_state_flsh_uv  : 1; /* [   26],          r,        0x0 */
            uint32_t reserved_27_31        : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } axi2dvp_status;

    /* 0x30 : axi2dvp_swap_addr_by */
    union {
        struct {
            uint32_t cr_axi_addr_swap_by : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } axi2dvp_swap_addr_by;

    /* 0x34 : axi2dvp_prefetch */
    union {
        struct {
            uint32_t cr_prefetch_v  : 12; /* [11: 0],        r/w,       0x28 */
            uint32_t reserved_12_31 : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } axi2dvp_prefetch;

    /* 0x38 : snsr2dvp_wait_pos */
    union {
        struct {
            uint32_t cr_snsr_fifo_th : 11; /* [10: 0],        r/w,       0x8b */
            uint32_t reserved_11_31  : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } snsr2dvp_wait_pos;

    /* 0x3c  reserved */
    uint8_t RESERVED0x3c[4];

    /* 0x40 : axi2dvp_start_addr_uv */
    union {
        struct {
            uint32_t cr_axi_addr_start_uv : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } axi2dvp_start_addr_uv;

    /* 0x44 : axi2dvp_swap_addr_uv */
    union {
        struct {
            uint32_t cr_axi_addr_swap_uv : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } axi2dvp_swap_addr_uv;
};

typedef volatile struct dtsrc_reg dtsrc_reg_t;

#endif /* __DTSRC_REG_H__ */
